tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/ioman_regs.h
/**
 * @file   
 * @brief   IOMAN hardware register definitions.
 */
/* *****************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2017-02-16 12:53:53 -0600 (Thu, 16 Feb 2017) $
 * $Revision: 26473 $
 *
 **************************************************************************** */

/* Define to prevent redundant inclusion. */
#ifndef _MXC_IOMAN_REGS_H_
#define _MXC_IOMAN_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
    If types are not defined elsewhere (CMSIS) define them here
*/
///@cond
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
///@endcond
/**
 * @ingroup ioman
 * @defgroup ioman_registers Registers
 * @brief IOMAN Registers
 */
/* **** Definitions **** */
/**
 * @ingroup ioman_registers
 * @defgroup wud_req_ports WUD_REQ_Px
 * Wakeup requests for each port
 */
/**
 * @ingroup ioman_registers
 * @defgroup wud_ack_ports WUD_ACK_Px
 * Wakeup acknowledgement for each port
 */    
/**
 * @ingroup wud_req_ports
 * Structure type for wakeup detection @b request for port 4 to port 7.  
 */
typedef struct {
    uint32_t wud_req_p4 : 8;        /**< Port 4 wake-up detection @b request. */
    uint32_t wud_req_p5 : 8;        /**< Port 5 wake-up detection @b request. */
    uint32_t wud_req_p6 : 8;        /**< Port 6 wake-up detection @b request. */
    uint32_t wud_req_p7 : 8;        /**< Port 7 wake-up detection @b request. */
} mxc_ioman_wud_req1_t;
/**
 * @ingroup wud_ack_ports
 * Structure type for wakeup detection @b acknowledgement for port 0 to port 3.  
 */
typedef struct {
    uint32_t wud_ack_p0 : 8;        /**< Port 0 wake-up detection @b acknowledgement. */
    uint32_t wud_ack_p1 : 8;        /**< Port 1 wake-up detection @b acknowledgement. */
    uint32_t wud_ack_p2 : 8;        /**< Port 2 wake-up detection @b acknowledgement. */
    uint32_t wud_ack_p3 : 8;        /**< Port 3 wake-up detection @b acknowledgement. */
} mxc_ioman_wud_ack0_t;

/**
 * @ingroup wud_req_ports
 * Structure type for wakeup detection @b request for port 0 to port 3.  
 */ 
typedef struct {
    uint32_t wud_req_p0 : 8;        /**< Port 0 wake-up detection @b request. */
    uint32_t wud_req_p1 : 8;        /**< Port 1 wake-up detection @b request. */
    uint32_t wud_req_p2 : 8;        /**< Port 2 wake-up detection @b request. */
    uint32_t wud_req_p3 : 8;        /**< Port 3 wake-up detection @b request. */
} mxc_ioman_wud_req0_t;
/**
 * @ingroup wud_ack_ports
 * Structure type for wakeup detection @b acknowledgement for port 4 to port 7.  
 */
typedef struct {
    uint32_t wud_ack_p4 : 8;        /**< Port 4 wake-up detection @b acknowledgement. */
    uint32_t wud_ack_p5 : 8;        /**< Port 5 wake-up detection @b acknowledgement. */
    uint32_t wud_ack_p6 : 8;        /**< Port 6 wake-up detection @b acknowledgement. */
    uint32_t wud_ack_p7 : 8;        /**< Port 7 wake-up detection @b acknowledgement. */
} mxc_ioman_wud_ack1_t;
/**
 * @ingroup ioman_registers
 * @defgroup ali_req_ports ALI_REQ_Px
 * Analog Input Request per port
 */
/**
 * @ingroup ioman_registers
 * @defgroup ali_ack_ports ALI_ACK_Px
 * Analog Input Acknowledgment per port
 */
/**
 * @ingroup ali_req_ports
 * Structure type for analog input @b request for port 0 to port 3.  
 */
typedef struct {
    uint32_t ali_req_p0 : 8;        /**< Port 0 analog input @b request.  */
    uint32_t ali_req_p1 : 8;        /**< Port 1 analog input @b request.  */
    uint32_t ali_req_p2 : 8;        /**< Port 2 analog input @b request.  */
    uint32_t ali_req_p3 : 8;        /**< Port 3 analog input @b request.  */
} mxc_ioman_ali_req0_t;
/**
 * @ingroup ali_req_ports
 * Structure type for analog input @b request for port 4 to port 7.  
 */
typedef struct {
    uint32_t ali_req_p4 : 8;        /**< Port 4 analog input @b request.  */
    uint32_t ali_req_p5 : 8;        /**< Port 5 analog input @b request.  */
    uint32_t ali_req_p6 : 8;        /**< Port 6 analog input @b request.  */
    uint32_t ali_req_p7 : 8;        /**< Port 7 analog input @b request.  */
} mxc_ioman_ali_req1_t;
/**
 * @ingroup ali_ack_ports
 * Structure type for analog input @b acknowledgement for port 0 to port 3.  
 */
typedef struct {
    uint32_t ali_ack_p0 : 8;        /**< Port 0 analog input @b acknowledgement.  */
    uint32_t ali_ack_p1 : 8;        /**< Port 1 analog input @b acknowledgement.  */
    uint32_t ali_ack_p2 : 8;        /**< Port 2 analog input @b acknowledgement.  */
    uint32_t ali_ack_p3 : 8;        /**< Port 3 analog input @b acknowledgement.  */
} mxc_ioman_ali_ack0_t;
/**
 * @ingroup ali_ack_ports
 * Structure type for analog input @b acknowledgement for port 4 to port 7.  
 */
typedef struct {
    uint32_t ali_ack_p4 : 8;        /**< Port 4 analog input @b acknowledgement.  */
    uint32_t ali_ack_p5 : 8;        /**< Port 5 analog input @b acknowledgement.  */
    uint32_t ali_ack_p6 : 8;        /**< Port 6 analog input @b acknowledgement.  */
    uint32_t ali_ack_p7 : 8;        /**< Port 7 analog input @b acknowledgement.  */
} mxc_ioman_ali_ack1_t;
/**
 * @ingroup ioman_registers
 * @defgroup ioman_periph_config Peripheral Configuration
 * Peripheral I/O Configuration Request and Acknowledment Objects
 * @{ 
 */
/**
 * Structure type for SPI XIP configuration @b requests. 
 */
typedef struct {
    uint32_t             : 4;       /**< Reserved: Do Not Modify.                       */
    uint32_t core_io_req : 1;       /**< Set to request the SPIX core external pins.    */
    uint32_t             : 3;       /**< Reserved: Do Not Modify.                       */
    uint32_t ss0_io_req  : 1;       /**< Set to request slave select 0 active out.      */
    uint32_t ss1_io_req  : 1;       /**< Set to request slave select 1 active out.      */
    uint32_t ss2_io_req  : 1;       /**< Set to request slave select 2 active out.      */
    uint32_t             : 1;       /**< Reserved: Do Not Modify.                       */
    uint32_t quad_io_req : 1;       /**< Set to request quad I/O operation.             */
    uint32_t             : 3;       /**< Reserved: Do Not Modify.                       */
    uint32_t fast_mode   : 1;       /**< Set to request fast mode operation.            */
    uint32_t             : 15;      /**< Reserved: Do Not Modify.                       */
} mxc_ioman_spix_req_t;
/**
 * Structure type for SPI XIP configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t             : 4;       /**< Reserved: Do Not Modify.                                           */
    uint32_t core_io_ack : 1;       /**< Is set if the request for the SPIX core external pins succeeded.   */
    uint32_t             : 3;       /**< Reserved: Do Not Modify.                                           */
    uint32_t ss0_io_ack  : 1;       /**< Is set if the request for the slave select 0 active out succeeded. */
    uint32_t ss1_io_ack  : 1;       /**< Is set if the request for the slave select 1 active out succeeded. */
    uint32_t ss2_io_ack  : 1;       /**< Is set if the request for the slave select 2 active out succeeded. */
    uint32_t             : 1;       /**< Reserved: Do Not Modify.                                           */
    uint32_t quad_io_ack : 1;       /**< Is set if the request for the quad I/O operation succeeded.        */
    uint32_t             : 3;       /**< Reserved: Do Not Modify.                                           */
    uint32_t fast_mode   : 1;       /**< Is set if the request for fast mode operation succeeded.           */
    uint32_t             : 15;      /**< Reserved: Do Not Modify.                                           */
} mxc_ioman_spix_ack_t;
/**
 * Structure type for UART0 configuration @b requests. 
 */
typedef struct {
    uint32_t io_map     : 1;        /**< Value for the desired pin mapping for the RX/TX pins.          */
    uint32_t cts_map    : 1;        /**< Value for the desired pin mapping for the CTS pin.             */
    uint32_t rts_map    : 1;        /**< Value for the desired pin mapping for the RTS pin.             */
    uint32_t            : 1;        /**< Reserved: Do No Modify.                                        */
    uint32_t io_req     : 1;        /**< RX/TX pin mapping, set to @p 1 to request or @p 0 to release.  */
    uint32_t cts_io_req : 1;        /**< CTS pin mapping, set to @p 1 to request or @p 0 to release.    */
    uint32_t rts_io_req : 1;        /**< RTS pin mapping, set to @p 1 to request or @p 0 to release.    */
    uint32_t            : 25;       /**< Reserved: Do No Modify.                                        */
} mxc_ioman_uart0_req_t;
/**
 * Structure type for UART0 configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t io_map     : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t cts_map    : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t rts_map    : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t            : 1;        /**< Reserved: Do No Modify.                */
    uint32_t io_ack     : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t cts_io_ack : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t rts_io_ack : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t            : 25;       /**< Reserved: Do No Modify.                */
} mxc_ioman_uart0_ack_t;
/**
 * Structure type for UART1 configuration @b requests.  
 */
typedef struct {
    uint32_t io_map     : 1;        /**< Value for the desired pin mapping for the RX/TX pins.          */
    uint32_t cts_map    : 1;        /**< Value for the desired pin mapping for the CTS pin.             */
    uint32_t rts_map    : 1;        /**< Value for the desired pin mapping for the RTS pin.             */
    uint32_t            : 1;        /**< Reserved: Do No Modify.                                        */
    uint32_t io_req     : 1;        /**< RX/TX pin mapping, set to @p 1 to request or @p 0 to release.  */
    uint32_t cts_io_req : 1;        /**< CTS pin mapping, set to @p 1 to request or @p 0 to release.    */
    uint32_t rts_io_req : 1;        /**< RTS pin mapping, set to @p 1 to request or @p 0 to release.    */
    uint32_t            : 25;       /**< Reserved: Do No Modify.                                        */
} mxc_ioman_uart1_req_t;
/**
 * Structure type for UART1 configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t io_map     : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t cts_map    : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t rts_map    : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t            : 1;        /**< Reserved: Do No Modify.                */
    uint32_t io_ack     : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t cts_io_ack : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t rts_io_ack : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t            : 25;       /**< Reserved: Do No Modify.                */
} mxc_ioman_uart1_ack_t;
/**
 * Structure type for UART2 configuration @b requests.  
 */
typedef struct {
    uint32_t io_map     : 1;        /**< Value for the desired pin mapping for the RX/TX pins.          */
    uint32_t cts_map    : 1;        /**< Value for the desired pin mapping for the CTS pin.             */
    uint32_t rts_map    : 1;        /**< Value for the desired pin mapping for the RTS pin.             */
    uint32_t            : 1;        /**< Reserved: Do No Modify.                                        */
    uint32_t io_req     : 1;        /**< RX/TX pin mapping, set to @p 1 to request or @p 0 to release.  */
    uint32_t cts_io_req : 1;        /**< CTS pin mapping, set to @p 1 to request or @p 0 to release.    */
    uint32_t rts_io_req : 1;        /**< RTS pin mapping, set to @p 1 to request or @p 0 to release.    */
    uint32_t            : 25;       /**< Reserved: Do No Modify.                                        */
} mxc_ioman_uart2_req_t;
/**
 * Structure type for UART2 configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t io_map     : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t cts_map    : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t rts_map    : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t            : 1;        /**< Reserved: Do No Modify.                */
    uint32_t io_ack     : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t cts_io_ack : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t rts_io_ack : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t            : 25;       /**< Reserved: Do No Modify.                */
} mxc_ioman_uart2_ack_t;
/**
 * Structure type for UART3 configuration @b requests.  
 */
typedef struct {
    uint32_t io_map     : 1;        /**< Value for the desired pin mapping for the RX/TX pins.          */
    uint32_t cts_map    : 1;        /**< Value for the desired pin mapping for the CTS pin.             */
    uint32_t rts_map    : 1;        /**< Value for the desired pin mapping for the RTS pin.             */
    uint32_t            : 1;        /**< Reserved: Do No Modify.                                        */
    uint32_t io_req     : 1;        /**< RX/TX pin mapping, set to @p 1 to request or @p 0 to release.  */
    uint32_t cts_io_req : 1;        /**< CTS pin mapping, set to @p 1 to request or @p 0 to release.    */
    uint32_t rts_io_req : 1;        /**< RTS pin mapping, set to @p 1 to request or @p 0 to release.    */
    uint32_t            : 25;       /**< Reserved: Do No Modify.                */
} mxc_ioman_uart3_req_t;
/**
 * Structure type for UART3 configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t io_map     : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t cts_map    : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t rts_map    : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t            : 1;        /**< Reserved: Do No Modify.                */
    uint32_t io_ack     : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t cts_io_ack : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t rts_io_ack : 1;        /**< Is set to @p 1 if request successful.  */
    uint32_t            : 25;       /**< Reserved: Do No Modify.                */
} mxc_ioman_uart3_ack_t;
/**
 * Structure type for I2C Master 0 configuration @b requests. 
 */
typedef struct {
    uint32_t             : 4;       /**< Reserved: Do No Modify.                                */
    uint32_t mapping_req : 1;       /**< Value for the desired pin mapping for the I2CM0 pins.  */       
    uint32_t             : 27;      /**< Reserved: Do No Modify.                                */
} mxc_ioman_i2cm0_req_t;
/**
 * Structure type for I2C Master 0 configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t             : 4;       /**< Reserved: Do No Modify.                                */
    uint32_t mapping_ack : 1;       /**< Is set to @p 1 if request successful.                  */
    uint32_t             : 27;      /**< Reserved: Do No Modify.                                */
} mxc_ioman_i2cm0_ack_t;
/**
 * Structure type for I2C Master 1 configuration @b requests. 
 */
typedef struct {
    uint32_t io_sel      : 2;      /**< Value for the desired pin mapping for the I2CM1 CLK and Data pins.  */
    uint32_t             : 2;      /**< Reserved: Do No Modify.                                             */
    uint32_t mapping_req : 1;      /**< Value for the desired pin mapping for the I2CM1 pins.               */
    uint32_t             : 27;     /**< Reserved: Do No Modify.                                             */
} mxc_ioman_i2cm1_req_t;
/**
 * Structure type for I2C Master 1 configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t io_sel      : 2;      /**< Non-zero if mapping request successful.                */
    uint32_t             : 2;      /**< Reserved: Do No Modify.                                */
    uint32_t mapping_ack : 1;      /**< Is set to @p 1 if request successful.                  */
    uint32_t             : 27;     /**< Reserved: Do No Modify.                                */
} mxc_ioman_i2cm1_ack_t;
/**
 * Structure type for I2C Master 2 configuration @b requests. 
 */
typedef struct {
    uint32_t io_sel      : 2;      /**< Value for the desired pin mapping for the I2CM2 CLK and Data pins.  */
    uint32_t             : 2;      /**< Reserved: Do No Modify.                                             */
    uint32_t mapping_req : 1;      /**< Value for the desired pin mapping for the I2CM2 pins.               */
    uint32_t             : 27;     /**< Reserved: Do No Modify.                                             */
} mxc_ioman_i2cm2_req_t;
/**
 * Structure type for I2C Master 2 configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t io_sel      : 2;      /**< Non-zero if mapping request successful.                */
    uint32_t             : 2;      /**< Reserved: Do No Modify.                                */
    uint32_t mapping_ack : 1;      /**< Is set to @p 1 if request successful.                  */
    uint32_t             : 27;     /**< Reserved: Do No Modify.                                */
} mxc_ioman_i2cm2_ack_t;
/**
 * Structure type for I2C Slave 0 configuration @b requests. 
 */
typedef struct {
    uint32_t io_sel      : 3;      /**< Value for the desired pin mapping for the I2CS0 CLK and Data pins.  */
    uint32_t             : 1;      /**< Reserved: Do No Modify.                                             */
    uint32_t mapping_req : 1;      /**< Value for the desired pin mapping for the I2CS0 pins.               */
    uint32_t             : 27;     /**< Reserved: Do No Modify.                                             */
} mxc_ioman_i2cs_req_t;
/**
 * Structure type for I2C Slave 0 configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t io_sel      : 3;      /**< Non-zero if mapping request successful.                */
    uint32_t             : 1;      /**< Reserved: Do No Modify.                                */
    uint32_t mapping_ack : 1;      /**< Is set to @p 1 if request successful.                  */
    uint32_t             : 27;     /**< Reserved: Do No Modify.                                */
} mxc_ioman_i2cs_ack_t;
/**
 * Structure type for SPI Master 0 configuration @b requests. 
 */
typedef struct {
    uint32_t             : 4;       /**< Reserved: Do Not Modify.                       */
    uint32_t core_io_req : 1;       /**< Set to request the SPIM0 core external pins.   */
    uint32_t             : 3;       /**< Reserved: Do Not Modify.                       */
    uint32_t ss0_io_req  : 1;       /**< Set to request slave select 0 active out.      */
    uint32_t ss1_io_req  : 1;       /**< Set to request slave select 1 active out.      */
    uint32_t ss2_io_req  : 1;       /**< Set to request slave select 2 active out.      */
    uint32_t ss3_io_req  : 1;       /**< Set to request slave select 3 active out.      */
    uint32_t ss4_io_req  : 1;       /**< Set to request slave select 4 active out.      */
    uint32_t             : 7;       /**< Reserved: Do Not Modify.                       */
    uint32_t quad_io_req : 1;       /**< Set to 1 to request Quad I/O for SPIM0.        */
    uint32_t             : 3;       /**< Reserved: Do Not Modify.                       */
    uint32_t fast_mode   : 1;       /**< Set to request fast mode operation for SPIM0.  */
    uint32_t             : 7;       /**< Reserved: Do Not Modify.                       */
} mxc_ioman_spim0_req_t;
/**
 * Structure type for SPI Master 0 configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t             : 4;       /**< Reserved: Do Not Modify.                                           */
    uint32_t core_io_ack : 1;       /**< Is set if the request for the SPIM0 core external pins succeeded.  */
    uint32_t             : 3;       /**< Reserved: Do Not Modify.                                           */
    uint32_t ss0_io_ack  : 1;       /**< Is set if the request for the slave select 0 active out succeeded. */
    uint32_t ss1_io_ack  : 1;       /**< Is set if the request for the slave select 1 active out succeeded. */
    uint32_t ss2_io_ack  : 1;       /**< Is set if the request for the slave select 2 active out succeeded. */
    uint32_t ss3_io_ack  : 1;       /**< Is set if the request for the slave select 3 active out succeeded. */
    uint32_t ss4_io_ack  : 1;       /**< Is set if the request for the slave select 4 active out succeeded. */
    uint32_t             : 7;       /**< Reserved: Do Not Modify.                                           */
    uint32_t quad_io_ack : 1;       /**< Is set if the request for the quad I/O operation succeeded.        */
    uint32_t             : 3;       /**< Reserved: Do Not Modify.                                           */
    uint32_t fast_mode   : 1;       /**< Is set if the request for fast mode operation succeeded.           */
    uint32_t             : 7;       /**< Reserved: Do Not Modify.                                           */
} mxc_ioman_spim0_ack_t;
