tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/ioman_regs.h
/**
 * Structure type for SPI Master 1 configuration @b requests. 
 */
typedef struct {
    uint32_t             : 4;      /**< Reserved: Do Not Modify.                       */
    uint32_t core_io_req : 1;      /**< Set to request the SPIM1 core external pins.   */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                       */
    uint32_t ss0_io_req  : 1;      /**< Set to request slave select 0 active out.      */
    uint32_t ss1_io_req  : 1;      /**< Set to request slave select 1 active out.      */
    uint32_t ss2_io_req  : 1;      /**< Set to request slave select 2 active out.      */
    uint32_t             : 9;      /**< Reserved: Do Not Modify.                       */
    uint32_t quad_io_req : 1;      /**< Set to request quad I/O operation.             */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                       */
    uint32_t fast_mode   : 1;      /**< Set to request fast mode operation.            */
    uint32_t             : 7;      /**< Reserved: Do Not Modify.                       */
} mxc_ioman_spim1_req_t;
/**
 * Structure type for SPI Master 1 configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t             : 4;      /**< Reserved: Do Not Modify.                                           */
    uint32_t core_io_ack : 1;      /**< Is set if the request for the SPIM1 core external pins succeeded.  */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                           */
    uint32_t ss0_io_ack  : 1;      /**< Is set if the request for the slave select 0 active out succeeded. */
    uint32_t ss1_io_ack  : 1;      /**< Is set if the request for the slave select 1 active out succeeded. */
    uint32_t ss2_io_ack  : 1;      /**< Is set if the request for the slave select 2 active out succeeded. */
    uint32_t             : 9;      /**< Reserved: Do Not Modify.                                           */
    uint32_t quad_io_ack : 1;      /**< Is set if the request for the quad I/O operation succeeded.        */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                           */
    uint32_t fast_mode   : 1;      /**< Is set if the request for fast mode operation succeeded.           */
    uint32_t             : 7;      /**< Reserved: Do Not Modify.                                           */
} mxc_ioman_spim1_ack_t;
/**
 * Structure type for SPI Master 2 configuration @b requests. 
 */
typedef struct {
    uint32_t mapping_req : 2;      /**< Set to the desired port pin mapping for the SPIM2.                  */
    uint32_t             : 2;      /**< Reserved: Do Not Modify.                                            */
    uint32_t core_io_req : 1;      /**< Set to request the SPIM2 core external pins.                        */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                            */
    uint32_t ss0_io_req  : 1;      /**< Set to request slave select 0 active out.                           */
    uint32_t ss1_io_req  : 1;      /**< Set to request slave select 1 active out.                           */
    uint32_t ss2_io_req  : 1;      /**< Set to request slave select 2 active out.                           */
    uint32_t             : 5;      /**< Reserved: Do Not Modify.                                            */
    uint32_t sr0_io_req  : 1;      /**< Set to 1 to request slave ready 0 input.                            */
    uint32_t sr1_io_req  : 1;      /**< Set to 1 to request slave ready 1 input.                            */
    uint32_t             : 2;      /**< Reserved: Do Not Modify.                                            */
    uint32_t quad_io_req : 1;      /**< Set to request quad I/O operation.                                  */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                            */
    uint32_t fast_mode   : 1;      /**< Set to request fast mode operation.                                 */
    uint32_t             : 7;      /**< Reserved: Do Not Modify.                                            */
} mxc_ioman_spim2_req_t;
/**
 * Structure type for SPI Master 2 configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t mapping_ack : 2;      /**< Non-zero if mapping request successful.                             */
    uint32_t             : 2;      /**< Reserved: Do Not Modify.                                            */
    uint32_t core_io_ack : 1;      /**< Is set if the request for the SPIM2 core external pins succeeded.   */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                            */
    uint32_t ss0_io_ack  : 1;      /**< Is set if the request for the slave select 0 active out succeeded.  */
    uint32_t ss1_io_ack  : 1;      /**< Is set if the request for the slave select 1 active out succeeded.  */
    uint32_t ss2_io_ack  : 1;      /**< Is set if the request for the slave select 2 active out succeeded.  */
    uint32_t             : 5;      /**< Reserved: Do Not Modify.                                            */
    uint32_t sr0_io_req  : 1;      /**< Is set if the request for the slave ready 0 active input succeeded. */
    uint32_t sr1_io_req  : 1;      /**< Is set if the request for the slave ready 1 active input succeeded. */
    uint32_t             : 2;      /**< Reserved: Do Not Modify.                                            */
    uint32_t quad_io_ack : 1;      /**< Is set if the request for the quad I/O operation succeeded.        */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                           */
    uint32_t fast_mode   : 1;      /**< Is set if the request for fast mode operation succeeded.           */
    uint32_t             : 7;      /**< Reserved: Do Not Modify.                                            */
} mxc_ioman_spim2_ack_t;
/**
 * Structure type for SPI Bridge configuration @b requests. 
 */
typedef struct {
    uint32_t             : 4;      /**< Reserved: Do Not Modify.                                            */
    uint32_t core_io_req : 1;      /**< Set to request the SPIB core external pins.                         */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                            */
    uint32_t quad_io_req : 1;      /**< Set to request quad I/O operation.                                  */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                            */
    uint32_t fast_mode   : 1;      /**< Set to request fast mode operation.                                 */
    uint32_t             : 19;     /**< Reserved: Do Not Modify.                                            */
} mxc_ioman_spib_req_t;
/**
 * Structure type for SPI Bridge configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t             : 4;      /**< Reserved: Do Not Modify.                                            */
    uint32_t core_io_ack : 1;      /**< Non-zero if mapping request successful.                             */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                            */
    uint32_t quad_io_ack : 1;      /**< Is set if the request for the quad I/O operation succeeded.         */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                            */
    uint32_t fast_mode   : 1;      /**< Is set if the request for fast mode operation succeeded.            */
    uint32_t             : 19;     /**< Reserved: Do Not Modify.                                            */
} mxc_ioman_spib_ack_t;
/**
 * Structure type for 1-Wire Master (OWM) configuration @b requests. 
 */
typedef struct {
    uint32_t             : 4;      /**< Reserved: Do Not Modify.                                            */
    uint32_t mapping_req : 1;      /**< Set to the desired port pin mapping for the 1-Wire Master.          */
    uint32_t epu_io_req  : 1;      /**< Set to 1 to request External Pull-up for the 1-Wire Master.         */
    uint32_t             : 26;     /**< Reserved: Do Not Modify.                                            */
} mxc_ioman_owm_req_t;
/**
 * Structure type for 1-Wire Master configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t             : 4;      /**< Reserved: Do Not Modify.                                            */
    uint32_t mapping_ack : 1;      /**< Non-zero if mapping request successful.                             */
    uint32_t epu_io_ack  : 1;      /**< Non-zero if external pull-up request successful.                    */
    uint32_t             : 26;     /**< Reserved: Do Not Modify.                                            */
} mxc_ioman_owm_ack_t;
/**
 * Structure type for SPI Slave configuration @b requests. 
 */
typedef struct {
    uint32_t mapping_req : 2;      /**< Set to desired port pin mapping for the SPIS peripheral.            */
    uint32_t             : 2;      /**< Reserved: Do Not Modify.                                            */
    uint32_t core_io_req : 1;      /**< Set to 1 to request the I/O be assigned to the SPIS.                */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                            */
    uint32_t quad_io_req : 1;      /**< Set to request quad I/O operation.                                  */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                            */
    uint32_t fast_mode   : 1;      /**< Set to request fast mode operation.                                 */
    uint32_t             : 19;     /**< Reserved: Do Not Modify.                                            */
} mxc_ioman_spis_req_t;
/**
 * Structure type for SPI Slave configuration @b acknowledgements. 
 */
typedef struct {
    uint32_t mapping_ack : 2;      /**< Non-zero if mapping request successful.                             */
    uint32_t             : 2;      /**< Reserved: Do Not Modify.                                            */
    uint32_t core_io_ack : 1;      /**< Non-zero if core io request successful.                             */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                            */
    uint32_t quad_io_ack : 1;      /**< Is set if the request for the quad I/O operation succeeded.         */
    uint32_t             : 3;      /**< Reserved: Do Not Modify.                                            */
    uint32_t fast_mode   : 1;      /**< Is set if the request for fast mode operation succeeded.            */
    uint32_t             : 19;     /**< Reserved: Do Not Modify.                                            */
} mxc_ioman_spis_ack_t;
/**@} end of defgroup ioman_periph_config */
/**
 * @ingroup ioman_registers
 * @defgroup ioman_pad_mode I/O Pad Modes
 * Configuration object to set the I/O pad operation for an I/O pin
 */
/**
 * @ingroup ioman_pad_mode
 * Structure type to configure the I/O pad mode options.
 */
typedef struct {
    uint32_t slow_mode     : 1;     /**< Slow mode I/O operation */
    uint32_t alt_rcvr_mode : 1;     /**< Alternative receive mode. */
    uint32_t               : 30;    /**< Reserved: Do not modify. */
} mxc_ioman_pad_mode_t;
/**
 * @ingroup wud_req_ports
 * Structure type for Wake-Up Detect (WUD) configuration @b requests for Port 8. 
 */
typedef struct {
    uint32_t wud_req_p8 : 2;        /**< Request bits for Wakeup Detect Mode requests for port P8. */
    uint32_t            : 30;       /**< Reserved: Do not modify. */
} mxc_ioman_wud_req2_t;
/**
 * @ingroup wud_ack_ports
 * Structure type for Wake-Up Detect (WUD) configuration @b acknowledgements for Port 8. 
 */
typedef struct {
    uint32_t wud_ack_p8 : 2;    /**< Acknowledgement bits for Wakeup Detect Mode requests for port P8. */
    uint32_t            : 30;   /**< Reserved: Do not modify. */
} mxc_ioman_wud_ack2_t;
/**
 * @ingroup ali_req_ports
 * Structure type for analog input @b request for port 8.  
 */
typedef struct {
    uint32_t ali_req_p8 : 2;    /**< Request bits for Analog Wakeup Detect Mode requests for port P8. */
    uint32_t            : 30;   /**< Reserved: Do not modify. */
} mxc_ioman_ali_req2_t;
/**
 * @ingroup ali_ack_ports
 * Structure type for Analog Input Acknowledgement for Port 8. 
 */
typedef struct {
    uint32_t ali_ack_p8 : 2;   /**< Acknowledgement bits for Analog Wakeup Detect Mode requests for port P8. */
    uint32_t            : 30;  /**< Reserved: Do not modify. */
} mxc_ioman_ali_ack2_t;


/**
 * @ingroup ioman_registers
 * Structure type for the IOMAN Register Interface.
 * The table below shows the IOMAN Regsiter Offsets from the Base IOMAN Peripheral Address #MXC_BASE_IOMAN.
 */
typedef struct {
    __IO uint32_t wud_req0;                             /**< Wakeup Detect Mode Request Register 0 (P0/P1/P2/P3)        */
    __IO uint32_t wud_req1;                             /**< Wakeup Detect Mode Request Register 1 (P4/P5/P6/P7)        */
    __IO uint32_t wud_ack0;                             /**< Wakeup Detect Mode Acknowledge Register 0 (P0/P1/P2/P3)    */
    __IO uint32_t wud_ack1;                             /**< Wakeup Detect Mode Acknowledge Register 1 (P4/P5/P6/P7)    */
    __IO uint32_t ali_req0;                             /**< Analog Input Request Register 0 (P0/P1/P2/P3)              */
    __IO uint32_t ali_req1;                             /**< Analog Input Request Register 1 (P4/P5/P6/P7)              */
    __IO uint32_t ali_ack0;                             /**< Analog Input Acknowledge Register 0 (P0/P1/P2/P3)          */
    __IO uint32_t ali_ack1;                             /**< Analog Input Acknowledge Register 1 (P4/P5/P6/P7)          */
    __IO uint32_t ali_connect0;                         /**< Analog I/O Connection Control Register 0                   */
    __IO uint32_t ali_connect1;                         /**< Analog I/O Connection Control Register 1                   */
    __IO uint32_t spix_req;                             /**< SPIX I/O Mode Request                                      */
    __IO uint32_t spix_ack;                             /**< SPIX I/O Mode Acknowledge                                  */
    __IO uint32_t uart0_req;                            /**< UART0 I/O Mode Request                                     */
    __IO uint32_t uart0_ack;                            /**< UART0 I/O Mode Acknowledge                                 */
    __IO uint32_t uart1_req;                            /**< UART1 I/O Mode Request                                     */
    __IO uint32_t uart1_ack;                            /**< UART1 I/O Mode Acknowledge                                 */
    __IO uint32_t uart2_req;                            /**< UART2 I/O Mode Request                                     */
    __IO uint32_t uart2_ack;                            /**< UART2 I/O Mode Acknowledge                                 */
    __IO uint32_t uart3_req;                            /**< UART3 I/O Mode Request                                     */
    __IO uint32_t uart3_ack;                            /**< UART3 I/O Mode Acknowledge                                 */
    __IO uint32_t i2cm0_req;                            /**< I2C Master 0 I/O Request                                   */
    __IO uint32_t i2cm0_ack;                            /**< I2C Master 0 I/O Acknowledge                               */
    __IO uint32_t i2cm1_req;                            /**< I2C Master 1 I/O Request                                   */
    __IO uint32_t i2cm1_ack;                            /**< I2C Master 1 I/O Acknowledge                               */
    __IO uint32_t i2cm2_req;                            /**< I2C Master 2 I/O Request                                   */
    __IO uint32_t i2cm2_ack;                            /**< I2C Master 2 I/O Acknowledge                               */
    __IO uint32_t i2cs_req;                             /**< I2C Slave I/O Request                                      */
    __IO uint32_t i2cs_ack;                             /**< I2C Slave I/O Acknowledge                                  */
    __IO uint32_t spim0_req;                            /**< SPI Master 0 I/O Mode Request                              */
    __IO uint32_t spim0_ack;                            /**< SPI Master 0 I/O Mode Acknowledge                          */
    __IO uint32_t spim1_req;                            /**< SPI Master 1 I/O Mode Request                              */
    __IO uint32_t spim1_ack;                            /**< SPI Master 1 I/O Mode Acknowledge                          */
    __IO uint32_t spim2_req;                            /**< SPI Master 2 I/O Mode Request                              */
    __IO uint32_t spim2_ack;                            /**< SPI Master 2 I/O Mode Acknowledge                          */
    __IO uint32_t spib_req;                             /**< SPI Bridge I/O Mode Request                                */
    __IO uint32_t spib_ack;                             /**< SPI Bridge I/O Mode Acknowledge                            */
    __IO uint32_t owm_req;                              /**< 1-Wire Master I/O Mode Request                             */
    __IO uint32_t owm_ack;                              /**< 1-Wire Master I/O Mode Acknowledge                         */
    __IO uint32_t spis_req;                             /**< SPI Slave I/O Mode Request                                 */
    __IO uint32_t spis_ack;                             /**< SPI Slave I/O Mode Acknowledge                             */
    __R  uint32_t rsv0A0[24];                           /**< RESERVED: DO NOT MODIFY                                    */
    __IO uint32_t use_vddioh_0;                         /**< Enable VDDIOH Register 0                                   */
    __IO uint32_t use_vddioh_1;                         /**< Enable VDDIOH Register 1                                   */
    __IO uint32_t use_vddioh_2;                         /**< Enable VDDIOH Register 2                                   */
    __R  uint32_t rsv10C;                               /**< RESERVED: DO NOT MODIFY                                    */
    __IO uint32_t pad_mode;                             /**< Pad Mode Control Register                                  */
    __R  uint32_t rsv114[27];                           /**< RESERVED: DO NOT MODIFY                                    */
    __IO uint32_t wud_req2;                             /**< Wakeup Detect Mode Request Register 2 (Port 8)             */
    __R  uint32_t rsv184;                               /**< RESERVED: DO NOT MODIFY                                    */
    __IO uint32_t wud_ack2;                             /**< Wakeup Detect Mode Acknowledge Register 2 (Port 8)         */
    __R  uint32_t rsv18C;                               /**< RESERVED: DO NOT MODIFY                                    */
    __IO uint32_t ali_req2;                             /**< Analog Input Request Register 2 (Port 8)                   */
    __R  uint32_t rsv194;                               /**< RESERVED: DO NOT MODIFY                                    */
    __IO uint32_t ali_ack2;                             /**< Analog Input Acknowledge Register 2 (Port 8)               */
    __R  uint32_t rsv19C;                               /**< RESERVED: DO NOT MODIFY                                    */
    __IO uint32_t ali_connect2;                         /**< Analog I/O Connection Control Register 2                   */
} mxc_ioman_regs_t;
/**@}*/

