tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/ioman_regs.h
/*
   Register offsets for module IOMAN.
*/
/**
 * @ingroup    ioman_registers
 * @defgroup   ioman_reg_offs IOMAN Register Offsets
 * @{
 * @details    The @ref IOMAN_REGS_OFFS_TABLE "IOMAN Register Offset Table"
 *             shows the register offsets for the IOMAN registers from the base
 *             IOMAN peripheral address, #MXC_BASE_IOMAN.
 * @anchor IOMAN_REGS_OFFS_TABLE
 * | Register     | Offset |
 * | :----------- | ------:|
 * | WUD_REQ0     | 0x0000 |
 * | WUD_REQ1     | 0x0004 |
 * | WUD_ACK0     | 0x0008 |
 * | WUD_ACK1     | 0x000C |
 * | ALI_REQ0     | 0x0010 |
 * | ALI_REQ1     | 0x0014 |
 * | ALI_ACK0     | 0x0018 |
 * | ALI_ACK1     | 0x001C |
 * | ALI_CONNECT0 | 0x0020 |
 * | ALI_CONNECT1 | 0x0024 |
 * | SPIX_REQ     | 0x0028 |
 * | SPIX_ACK     | 0x002C |
 * | UART0_REQ    | 0x0030 |
 * | UART0_ACK    | 0x0034 |
 * | UART1_REQ    | 0x0038 |
 * | UART1_ACK    | 0x003C |
 * | UART2_REQ    | 0x0040 |
 * | UART2_ACK    | 0x0044 |
 * | UART3_REQ    | 0x0048 |
 * | UART3_ACK    | 0x004C |
 * | I2CM0_REQ    | 0x0050 |
 * | I2CM0_ACK    | 0x0054 |
 * | I2CM1_REQ    | 0x0058 |
 * | I2CM1_ACK    | 0x005C |
 * | I2CM2_REQ    | 0x0060 |
 * | I2CM2_ACK    | 0x0064 |
 * | I2CS_REQ     | 0x0068 |
 * | I2CS_ACK     | 0x006C |
 * | SPIM0_REQ    | 0x0070 |
 * | SPIM0_ACK    | 0x0074 |
 * | SPIM1_REQ    | 0x0078 |
 * | SPIM1_ACK    | 0x007C |
 * | SPIM2_REQ    | 0x0080 |
 * | SPIM2_ACK    | 0x0084 |
 * | SPIB_REQ     | 0x0088 |
 * | SPIB_ACK     | 0x008C |
 * | OWM_REQ      | 0x0090 |
 * | OWM_ACK      | 0x0094 |
 * | SPIS_REQ     | 0x0098 |
 * | SPIS_ACK     | 0x009C |
 * | USE_VDDIOH_0 | 0x0100 |
 * | USE_VDDIOH_1 | 0x0104 |
 * | USE_VDDIOH_2 | 0x0108 |
 * | PAD_MODE     | 0x0110 |
 * | WUD_REQ2     | 0x0180 |
 * | WUD_ACK2     | 0x0188 |
 * | ALI_REQ2     | 0x0190 |
 * | ALI_ACK2     | 0x0198 |
 * | ALI_CONNECT2 | 0x01A0 |
 */
#define MXC_R_IOMAN_OFFS_WUD_REQ0       ((uint32_t)0x00000000UL)    /**< WUD_REQ0 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_WUD_REQ1       ((uint32_t)0x00000004UL)    /**< WUD_REQ1 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_WUD_ACK0       ((uint32_t)0x00000008UL)    /**< WUD_ACK0 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_WUD_ACK1       ((uint32_t)0x0000000CUL)    /**< WUD_ACK1 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_ALI_REQ0       ((uint32_t)0x00000010UL)    /**< ALI_REQ0 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_ALI_REQ1       ((uint32_t)0x00000014UL)    /**< ALI_REQ1 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_ALI_ACK0       ((uint32_t)0x00000018UL)    /**< ALI_ACK0 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_ALI_ACK1       ((uint32_t)0x0000001CUL)    /**< ALI_ACK1 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_ALI_CONNECT0   ((uint32_t)0x00000020UL)    /**< ALI_CONNECT0 Register Offset from base IOMAN Peripheral Address.   */
#define MXC_R_IOMAN_OFFS_ALI_CONNECT1   ((uint32_t)0x00000024UL)    /**< ALI_CONNECT1 Register Offset from base IOMAN Peripheral Address.   */
#define MXC_R_IOMAN_OFFS_SPIX_REQ       ((uint32_t)0x00000028UL)    /**< SPIX_REQ Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_SPIX_ACK       ((uint32_t)0x0000002CUL)    /**< SPIX_ACK Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_UART0_REQ      ((uint32_t)0x00000030UL)    /**< UART0_REQ Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_UART0_ACK      ((uint32_t)0x00000034UL)    /**< UART0_ACK Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_UART1_REQ      ((uint32_t)0x00000038UL)    /**< UART1_REQ Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_UART1_ACK      ((uint32_t)0x0000003CUL)    /**< UART1_ACK Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_UART2_REQ      ((uint32_t)0x00000040UL)    /**< UART2_REQ Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_UART2_ACK      ((uint32_t)0x00000044UL)    /**< UART2_ACK Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_UART3_REQ      ((uint32_t)0x00000048UL)    /**< UART3_REQ Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_UART3_ACK      ((uint32_t)0x0000004CUL)    /**< UART3_ACK Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_I2CM0_REQ      ((uint32_t)0x00000050UL)    /**< I2CM0_REQ Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_I2CM0_ACK      ((uint32_t)0x00000054UL)    /**< I2CM0_ACK Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_I2CM1_REQ      ((uint32_t)0x00000058UL)    /**< I2CM1_REQ Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_I2CM1_ACK      ((uint32_t)0x0000005CUL)    /**< I2CM1_ACK Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_I2CM2_REQ      ((uint32_t)0x00000060UL)    /**< I2CM2_REQ Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_I2CM2_ACK      ((uint32_t)0x00000064UL)    /**< I2CM2_ACK Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_I2CS_REQ       ((uint32_t)0x00000068UL)    /**< I2CS_REQ Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_I2CS_ACK       ((uint32_t)0x0000006CUL)    /**< I2CS_ACK Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_SPIM0_REQ      ((uint32_t)0x00000070UL)    /**< SPIM0_REQ Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_SPIM0_ACK      ((uint32_t)0x00000074UL)    /**< SPIM0_ACK Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_SPIM1_REQ      ((uint32_t)0x00000078UL)    /**< SPIM1_REQ Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_SPIM1_ACK      ((uint32_t)0x0000007CUL)    /**< SPIM1_ACK Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_SPIM2_REQ      ((uint32_t)0x00000080UL)    /**< SPIM2_REQ Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_SPIM2_ACK      ((uint32_t)0x00000084UL)    /**< SPIM2_ACK Register Offset from base IOMAN Peripheral Address.      */
#define MXC_R_IOMAN_OFFS_SPIB_REQ       ((uint32_t)0x00000088UL)    /**< SPIB_REQ Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_SPIB_ACK       ((uint32_t)0x0000008CUL)    /**< SPIB_ACK Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_OWM_REQ        ((uint32_t)0x00000090UL)    /**< OWM_REQ Register Offset from base IOMAN Peripheral Address.        */
#define MXC_R_IOMAN_OFFS_OWM_ACK        ((uint32_t)0x00000094UL)    /**< OWM_ACK Register Offset from base IOMAN Peripheral Address.        */
#define MXC_R_IOMAN_OFFS_SPIS_REQ       ((uint32_t)0x00000098UL)    /**< SPIS_REQ Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_SPIS_ACK       ((uint32_t)0x0000009CUL)    /**< SPIS_ACK Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_USE_VDDIOH_0   ((uint32_t)0x00000100UL)    /**< USE_VDDIOH_0 Register Offset from base IOMAN Peripheral Address.   */
#define MXC_R_IOMAN_OFFS_USE_VDDIOH_1   ((uint32_t)0x00000104UL)    /**< USE_VDDIOH_1 Register Offset from base IOMAN Peripheral Address.   */
#define MXC_R_IOMAN_OFFS_USE_VDDIOH_2   ((uint32_t)0x00000108UL)    /**< USE_VDDIOH_2 Register Offset from base IOMAN Peripheral Address.   */
#define MXC_R_IOMAN_OFFS_PAD_MODE       ((uint32_t)0x00000110UL)    /**< PAD_MODE Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_WUD_REQ2       ((uint32_t)0x00000180UL)    /**< WUD_REQ2 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_WUD_ACK2       ((uint32_t)0x00000188UL)    /**< WUD_ACK2 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_ALI_REQ2       ((uint32_t)0x00000190UL)    /**< ALI_REQ2 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_ALI_ACK2       ((uint32_t)0x00000198UL)    /**< ALI_ACK2 Register Offset from base IOMAN Peripheral Address.       */
#define MXC_R_IOMAN_OFFS_ALI_CONNECT2   ((uint32_t)0x000001A0UL)    /**< ALI_CONNECT2 Register Offset from base IOMAN Peripheral Address.   */
/**@} end of ingroup ioman_regs_offs*/

